package main

import (
	"fmt"
	"math"
)

func main() {
	/*

		Задача 4: Решение квадратного уравнения
		Для уравнения ax² + bx + c = 0 найти дискриминант и оба корня (если они существуют).
		Учесть случаи когда D < 0(комплексные корни).
		Не использовать циклы для вычисления квадратного корня (применить итерационную формулу).

	*/

	var a, b, c float64

	fmt.Scanln(&a, &b, &c)
	D := math.Pow(b, 2) - (4 * a * c)

	if D < 0.0 {

		fmt.Print("дискриминант меньше 0")
		return

	}

	root1 := (-b + math.Sqrt(D)) / (2 * a)
	root2 := (-b - math.Sqrt(D)) / (2 * a)

	fmt.Println(root1, root2)

}
